app/views/people/index.html.erb

SELECT "accounts"."username" FROM "accounts" WHERE (id = 2)
---
        <td><%= person.address %></td>
        <td><%= Account.where("id = ?", person.account_id).pluck(:username).first %></td>