app/views/reservations/_form.html.erb

SELECT "units".* FROM "units"
---
    <%= form.label :Room_Number %>
    <%= form.collection_select(:unit_id, Unit.all, :id, :room_number, :prompt => 'Select Room Number') %>

SELECT "types"."price" FROM "types" WHERE (id = 'unit_id')
---
    <%= form.label :total_amount %>
    <%= form.text_field :total_amount, id: :reservation_total_amount, :value => Type.where("id = ?", :unit_id).pluck(:price).first %>