app/views/reservations/_unit_show.html.erb

  <tbody>
    <% @units = Unit.all %>
---
SELECT "units".* FROM "units"


        <td><%= Type.where("id = ?", unit.type_id).pluck(:name).first %></td>
---
SELECT "types"."name" FROM "types" WHERE (id = 1)

        <td><%= unit.room_number %></td>
        <td><%= Type.where("id = ?", unit.type_id).pluck(:price).first %></td>
---
SELECT "types"."price" FROM "types" WHERE (id = 1)