app/views/reservations/index.html.erb

SELECT "accounts"."user_level" FROM "accounts" WHERE (id = 1)
---
      <% @get_id = Person.where("id = ?", session[:user_id]).pluck(:id).first %>
      <% @user_level = Account.where("id = ?", @get_id).pluck(:user_level).first %>

SELECT "units"."room_number" FROM "units" WHERE (id = 1)
---
        <% if reservation.person_id == session[:user_id] or @user_level == 'admin' %>
          <td><%= Unit.where("id = ?", reservation.unit_id).pluck(:room_number).first %></td>

SELECT "units"."type_id" FROM "units" WHERE (id = 1)
SELECT "types"."price" FROM "types" WHERE (id = 1)
---
          <td><%= reservation.status %></td>
          <% getter = Unit.where("id = ?", reservation.unit_id).pluck(:type_id).first %>
          <td><%= Type.where("id = ?", getter).pluck(:price).first %></td>