app/views/payments/_form.html.erb

SELECT "accounts"."user_level" FROM "accounts" WHERE (id = 2)
---
<% @get_id = Person.where("id = ?", session[:user_id]).pluck(:id).first %>
<% @user_level = Account.where("id = ?", @get_id).pluck(:user_level).first %>

SELECT "reservations".* FROM "reservations"
---
    <%= form.label :reservation_id %>
    <%= form.collection_select(:reservation_id, Reservation.all, :id, :id, :prompt => 'Payment for what reservation?', :onchange => "change_persona_id();") %>