app/views/payments/index.html.erb

SELECT "accounts"."user_level" FROM "accounts" WHERE (id = 2)
---
<% @get_id = Person.where("id = ?", session[:user_id]).pluck(:id).first %>
<% @user_level = Account.where("id = ?", @get_id).pluck(:user_level).first %>