app/views/payments/show.html.erb

<% @get_id = Person.where("id = ?", session[:user_id]).pluck(:id).first %>
<% @user_level = Account.where("id = ?", @get_id).pluck(:user_level).first %>
---
SELECT "accounts"."user_level" FROM "accounts" WHERE (id = 2)