app/views/units/_form.html.erb

SELECT "accounts"."user_level" FROM "accounts" WHERE (id = 1)
---
<% @get_id = Person.where("id = ?", session[:user_id]).pluck(:id).first %>
<% @user_level = Account.where("id = ?", @get_id).pluck(:user_level).first %>

SELECT "buildings".* FROM "buildings"
---
    <%= form.label :building_id %>
    <%= form.collection_select(:building_id, Building.all, :id, :name, :prompt => 'Select Building') %>

SELECT "types".* FROM "types"
---
    <%= form.label :Room_Type %>
    <%= form.collection_select(:type_id, Type.all, :id, :name, :prompt => 'Select Room Type') %>