app/views/units/index.html.erb

SELECT "accounts"."user_level" FROM "accounts" WHERE (id = 1)
---
<% @get_id = Person.where("id = ?", session[:user_id]).pluck(:id).first %>
<% @user_level = Account.where("id = ?", @get_id).pluck(:user_level).first %>

SELECT "buildings"."name" FROM "buildings" WHERE (id = 1)
SELECT "types"."name" FROM "types" WHERE (id = 1)
---
      <tr>
        <td><%= Building.where("id = ?", unit.building_id).pluck(:name).first %></td>
        <td><%= Type.where("id = ?", unit.type_id).pluck(:name).first %></td>

SELECT "types"."price" FROM "types" WHERE (id = 1)
---
        <td><%= unit.room_number %></td>
        <td><%= Type.where("id = ?", unit.type_id).pluck(:price).first %></td>