app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("username", "email_add", "created_at", "updated_at", "user_level") VALUES (?, ?, ?, ?, ?)  [["username", "Administrator"], ["email_add", "sample_email@google.com"], ["created_at", "2018-05-27 12:29:07.367273"], ["updated_at", "2018-05-27 12:29:07.367273"], ["user_level", "user"]]