app/controllers/buildings_controller.rb

  def create
    @building = Building.new(building_params)

    respond_to do |format|
      if @building.save
---
INSERT INTO "buildings" ("name", "address", "owner", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_building
      @building = Building.find(params[:id])
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]