app/controllers/payments_controller.rb

  def create
    @payment = Payment.new(payment_params)

    respond_to do |format|
      if @payment.save
---
INSERT INTO "payments" ("reservation_id", "person_id", "amount_paid", "date_paid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["reservation_id", 1], ["person_id", 2], ["amount_paid", 37000.0], ["date_paid", "2018-05-27"], ["created_at", "2018-05-27 14:05:14.994113"], ["updated_at", "2018-05-27 14:05:14.994113"]]