app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
        initial = Unit.where("id = ?", @reservation.unit_id).pluck(:type_id).first
        @reservation.total_amount = Type.where("id = ?", initial).pluck(:price).first
---
INSERT INTO "reservations" ("unit_id", "person_id", "start_date", "end_date", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "units"."type_id" FROM "units" WHERE (id = 1)
SELECT "types"."price" FROM "types" WHERE (id = 1)