app/controllers/sessions_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."username" = ? LIMIT ?  [["username", "admins"], ["LIMIT", 1]]
---
def create
  user = Account.find_by_username(params[:username])