app/controllers/types_controller.rb

  def create
    @type = Type.new(type_params)

    respond_to do |format|
      if @type.save
---
INSERT INTO "types" ("name", "number_bed", "max_person", "food_service", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_type
      @type = Type.find(params[:id])
---
SELECT  "types".* FROM "types" WHERE "types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]