app/controllers/units_controller.rb

INSERT INTO "units" ("building_id", "type_id", "person_id", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["building_id", 1], ["type_id", 1], ["person_id", 2], ["room_number", 99], ["created_at", "2018-05-27 13:01:37.731863"], ["updated_at", "2018-05-27 13:01:37.731863"]]
---
  def create
    @unit = Unit.new(unit_params)

    respond_to do |format|
      if @unit.save

SELECT  "units".* FROM "units" WHERE "units"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_unit
      @unit = Unit.find(params[:id])