app/views/accounts/_form.html.erb

  <% @get_id = Person.where("id = ?", session[:user_id]).pluck(:id).first %>
  <% @user_level = Account.where("id = ?", @get_id).pluck(:user_level).first %>
---
SELECT "accounts"."user_level" FROM "accounts" WHERE (id = 1)

  <div class="form-group">
    <% if Account.exists?(:user_level => "admin") %>
---
SELECT  1 AS one FROM "accounts" WHERE "accounts"."user_level" = ? LIMIT ?  [["user_level", "admin"], ["LIMIT", 1]]